In [9]:
# Create DataFrame using a dictionary
import pandas as pd

# Create a simple dataset of people
data = {'Name': ["John", "Anna", "Peter", "Linda"],
        'Location': ["New York", "Paris", "Berlin", "London"],
        'Age': [24, 13, 53, 33]
       }

data_pandas = pd.DataFrame(data)
# display() is a function from the IPythom.display module allows pretty printing of dataframes
display(data_pandas)

    Name  Location  Age
0   John  New York   24
1   Anna     Paris   13
2  Peter    Berlin   53
3  Linda    London   33

In [11]:
# Select all rows that have an age column greater than 30
display(data_pandas[data_pandas.Age > 30])

    Name Location  Age
2  Peter   Berlin   53
3  Linda   London   33

In [13]:
# Select age less than or equal to 20
display(data_pandas[data_pandas.Age <= 20])

   Name Location  Age
1  Anna    Paris   13

In [19]:
# Select rows where Location is "Paris"
display(data_pandas[data_pandas.Location == "Paris"])

   Name Location  Age
1  Anna    Paris   13

In [25]:
# Select rows where age is between 20 and 40
display(data_pandas[(data_pandas.Age >= 20) & (data_pandas.Age <= 40)])

    Name  Location  Age
0   John  New York   24
3  Linda    London   33

In [29]:
# Exclude rows where Age is 13
display(data_pandas[data_pandas.Age != 13])

    Name  Location  Age
0   John  New York   24
2  Peter    Berlin   53
3  Linda    London   33

In [31]:
# Select rows where name is in list
display(data_pandas[data_pandas.Name.isin(["John", "Linda"])])

    Name  Location  Age
0   John  New York   24
3  Linda    London   33

In [33]:
# Select rows where Location contain "on" like "London"
display(data_pandas[data_pandas.Location.str.contains("on")])

    Name Location  Age
3  Linda   London   33

In [37]:
# Add a new column(e.g., Senior = Age > 50)
data_pandas["Senior"] = data_pandas.Age > 50
display(data_pandas)

    Name  Location  Age  Senior
0   John  New York   24   False
1   Anna     Paris   13   False
2  Peter    Berlin   53    True
3  Linda    London   33   False

In [39]:
# Chain filters or use .query()
display(data_pandas.query("Age > 20 and Location == 'London'"))

    Name Location  Age  Senior
3  Linda   London   33   False

In [51]:
# Select a Single Column: Name in series
display(data_pandas["Name"])

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [53]:
display(data_pandas.Name)

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [55]:
# Selece as a DataFrame with the column name visible in table format
display(data_pandas[["Name"]])

    Name
0   John
1   Anna
2  Peter
3  Linda

In [57]:
display(data_pandas[["Name", "Age"]])

    Name  Age
0   John   24
1   Anna   13
2  Peter   53
3  Linda   33

In [59]:
# Sort by Name A-Z
display(data_pandas.sort_values(by="Name"))

    Name  Location  Age  Senior
1   Anna     Paris   13   False
0   John  New York   24   False
3  Linda    London   33   False
2  Peter    Berlin   53    True

In [61]:
# Sort by Name Z-A
display(data_pandas.sort_values(by="Name", ascending=False))

    Name  Location  Age  Senior
2  Peter    Berlin   53    True
3  Linda    London   33   False
0   John  New York   24   False
1   Anna     Paris   13   False

In [63]:
# Reset index after sorting
display(data_pandas.sort_values(by="Name").reset_index(drop=True))

    Name  Location  Age  Senior
0   Anna     Paris   13   False
1   John  New York   24   False
2  Linda    London   33   False
3  Peter    Berlin   53    True